app/controllers/students_controller.rb

SELECT  "students".* FROM "students" WHERE "students"."id" = ? LIMIT ?  [["id", 3], ["LIMIT", 1]]
UPDATE "students" SET "first_name" = ?, "last_name" = ?, "updated_at" = ? WHERE "students"."id" = ?  [["first_name", "Floci edited"], ["last_name", "Flocescu edited"], ["updated_at", "2020-05-26 16:02:15.227931"], ["id", 3]]
---
    def update
        @student = Student.find(params[:id])
        @student.update(first_name: params[:student][:first_name], last_name: params[:student][:last_name])